tests/fvModelMatch/0.orig/I
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    radSource
    {
        // Diffuse Lambertian wall: radiance = emissivePower / pi.
        // Total emitted flux per band = emissivePower (W/m^2).
        type            diffuseEmitter;
        nBands          2;
        emissivePower   (5 5);
        value           uniform 0;
    }
    radOut
    {
        // Black absorber: R = 0, so refValue stays at 0 and outgoing
        // radiance from this wall is forced to zero (perfect sink).
        type            reflective;
        diffuseFraction 0;
        reflectionCoef  0;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 0;
    }
    sides
    {
        // Specular mirrors (R = 1, diffuseFraction = 0). With perfect
        // mirrors at y = 0 and y = 0.1, the finite y-extent becomes
        // equivalent to an infinite tiled slab, so G(x) matches the
        // 1-D plane-parallel analytical 2*pi*L_w*E_2(kappa*x).
        type            reflective;
        diffuseFraction 0;
        reflectionCoef  1;
        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
