tests/fvModelMatch/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1

# Source tutorial run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

# Clean prior state so runApplication does not skip on stale log.<app>.
./Allclean > /dev/null 2>&1 || true

# Restore stock initial fields
rm -rf 0
cp -r 0.orig 0

runApplication blockMesh
runApplication foamRun

# ----------------------------------------------------------------------------
